
{
    "resources": [
        {
            "id": "penal-code",
            "title": "San Andreas Penal Code",
            "description": "Открыть уголовный кодекс Сан-Андреас.",
            "icon": "BookOpen",
            "type": "link",
            "href": "URL_PENAL_CODE"
        },
        {
            "id": "bail-schedule",
            "title": "Constitution of San Andreas",
            "description": "Открыть конституцию Сан-Андреас.",
            "icon": "Landmark",
            "type": "link",
            "href": "URL_BAIL_SCHEDULE"
        },
        {
            "id": "traffic-citations",
            "title": "Traffic Citations",
            "description": "Ознакомьтесь с ключевыми юридическими прецедентами при выдаче справок о дорожном нарушении.",
            "icon": "Car",
            "type": "dialog",
            "content": {
                "title": "Traffic Citations",
                "body": "При выдаче штрафа за нарушение ПДД обвиняемый должен быть юридически проинформирован о своих правах и связанном с этим судебном процессе. Подпись на квитанции не требуется, так как она служит только для подтверждения получения и не является признанием вины. Штрафы также могут выдаваться в электронном виде, в этом случае они доставляются почтой по зарегистрированному адресу обвиняемого.\n\nКлючевая информация относительно штрафов:\n- Штраф должен быть либо оплачен, либо обжалован в течение двадцати восьми (28) дней с даты его выдачи. Обжалование включает в себя официальное оспаривание нарушения в суде. **(SA P.C. 1007)**\n- Оплата штрафа представляет собой юридическое признание вины, что приводит к автоматическому закрытию дела, если оно было обжаловано **(SA People v. Wyse)**.\n- Неуплата или необжалование может привести к выдаче ордера на неоплаченный штраф. Это уполномочивает сотрудников правоохранительных органов на арест или конфискацию личного имущества для покрытия задолженности и может привести к дополнительным штрафным санкциям, таким как приостановление действия водительских прав. **(SA P.C. 1210 & 1211)**"
            }
        },
        {
            "id": "miranda-rights",
            "title": "Miranda Rights",
            "description": "Перед допросом подозреваемого необходимо ознакомить с его правами, чтобы его показания были приемлемы в суде, поскольку он должен быть предупрежден о риске самооговора.",
            "icon": "ShieldCheck",
            "type": "default",
            "button_text": "Скопировать",
            "button_action": "copy",
            "button_content": "Вы имеете право хранить молчание. Все, что вы скажете, может быть использовано против вас в суде. Вы имеете право на присутствие адвоката во время любого допроса. Если вы не можете позволить себе нанять адвоката, он будет назначен для вас государством. Вы понимаете?"
        },
        {
            "id": "streets-act",
            "title": "The Law on Combating Street Terrorism",
            "description": "Открыть закон о борьбе с уличной преступностью.",
            "icon": "TrafficCone",
            "type": "link",
            "href": "URL_STREETS"
        }
    ]
}
